---
kind: type
id: T:Autodesk.Revit.DB.FilterNumericValueRule
source: html/a330c19c-4916-97e3-7a3a-8d4baab1308d.htm
---
# Autodesk.Revit.DB.FilterNumericValueRule

Base for all classes that use a FilterNumericRuleEvaluator to perform their comparisons

## Syntax (C#)
```csharp
public class FilterNumericValueRule : FilterValueRule
```